contact me in telegram [alex seikin](https://t.me/seikin_alexey)

## Задание
У вас SQL база с таблицами магазина, который существует много лет:
1) Users(userId, age)
2) Purchases (purchaseId, userId, itemId, date)
3) Items (itemId, price).

Напишите SQL запросы для расчета следующих метрик:

А) какую сумму в среднем в месяц тратит:
  - пользователи в возрастном диапазоне от 18 до 25 лет включительно
  - пользователи в возрастном диапазоне от 26 до 35 лет включительно

Б) в каком месяце года выручка от пользователей в возрастном диапазоне 35+ самая большая

В) Какой товар дает наибольший вклад в выручку за последний год

Г) топ-3 товаров по выручке и их доля в общей выручке за любой год

Будет здорово, если ваше решение оформлено в виде работающего кода и основательно протестировано на придуманных данных (код наполнения бд НЕ прикладывайте). 
Для тестирования можно использовать онлайн-редактор https://sqliteonline.com/
Предпочтительный диалект - PostgreSQL, но можете использовать любой из доступных.

## План работы

1. создать бд и подключится к ней
2. импортировать таблицы с игрушечными данными в бд
3. выполнить SQL запросы из задания

## Импорты

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import csv
from io import StringIO

## Вспомогательные функции

In [2]:
import csv
from io import StringIO

from sqlalchemy import create_engine

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [3]:
# создание подключения к базе данных PostgresSQL
db_host = 'surus.db.elephantsql.com'
db_name = 'xftllppj'
db_user_name = 'xftllppj'
db_pass = 'nSZxkk4NKFagwgxRE8YsRjKO0j3EWUbW'

connecton_ps = create_engine(f'postgresql+psycopg2://{db_user_name}:{db_pass}@{db_host}/{db_name}')
#connecton_ps = create_engine('postgresql+psycopg2://xftllppj:nSZxkk4NKFagwgxRE8YsRjKO0j3EWUbW@surus.db.elephantsql.com/xftllppj')

In [4]:
# запрос к бд
def select(sql):
  return pd.read_sql(sql, connecton_ps)

 ## Импорт датасетов в переменные

In [5]:
# Импорт датасета с пользователями
users = pd.read_csv('datasets/who_is_blogger_dataset_users.csv')
users.head(5)

   user_id   age
0      570  33.0
1      580  43.0
2      568  52.0
3      829  35.0
4      413  28.0

In [6]:
# Импорт датасета с товарами
items = pd.read_csv('datasets/who_is_blogger_dataset_items.csv')
items.head(5)

   item_id   price
0        1  161.38
1        2   35.34
2        3  146.50
3        4  119.21
4        5  105.24

In [7]:
# Импорт датасета с покупками с преобразованием даты к типу datetime64[ns]
purchases = pd.read_csv('datasets/who_is_blogger_dataset_purchases.csv')
purchases['date'] = pd.to_datetime(purchases['date'], format='%Y-%m-%d %H:%M:%S')
display(purchases.dtypes)
display(purchases.head(5))

purchase_id             int64
item_id                 int64
user_id                 int64
date           datetime64[ns]
amount                float64
dtype: object

   purchase_id  item_id  user_id                date  amount
0         4850       39       47 2008-04-06 11:54:47  161.38
1         2356       10       45 2007-07-28 00:00:19   35.34
2         2922      117       33 2008-03-14 20:43:54  146.50
3         4929      128       77 2007-12-18 13:03:24  119.21
4          510      113        6 2007-11-09 05:18:30  105.24

## Заливка датасетов в базу данных

In [8]:
users.to_sql('users', connecton_ps, index=False, if_exists='replace', method=psql_insert_copy)
items.to_sql('items', connecton_ps, index=False, if_exists='replace', method=psql_insert_copy)
purchases.to_sql('purchases', connecton_ps, index=False, if_exists='replace', method=psql_insert_copy)

## Тестовые запросы к БД

In [9]:
sql = '''
SELECT * 
FROM users 
LIMIT 5
'''
select(sql)

   user_id   age
0      570  33.0
1      580  43.0
2      568  52.0
3      829  35.0
4      413  28.0

In [10]:
sql = '''
SELECT * 
FROM items 
LIMIT 5
'''
select(sql)

   item_id   price
0        1  161.38
1        2   35.34
2        3  146.50
3        4  119.21
4        5  105.24

In [11]:
sql = '''
SELECT * 
FROM purchases 
LIMIT 5
'''
select(sql)

   purchase_id  item_id  user_id                date  amount
0         4850       39       47 2008-04-06 11:54:47  161.38
1         2356       10       45 2007-07-28 00:00:19   35.34
2         2922      117       33 2008-03-14 20:43:54  146.50
3         4929      128       77 2007-12-18 13:03:24  119.21
4          510      113        6 2007-11-09 05:18:30  105.24

## Запросы к БД PostresSQL из заданий

### Задание А

#### Какую сумму в среднем в месяц тратят пользователи в возрастном диапазоне от 18 до 25 лет включительно

In [12]:
# ID пользователей 18 до 25 лет включительно

sql = '''
select DISTINCT user_id
from users
where age <= 25 and age > 18
ORDER BY user_id
'''
select(sql)

     user_id
0          3
1          6
2         22
3         24
4         29
..       ...
161      968
162      970
163      972
164      980
165      986

[166 rows x 1 columns]

In [13]:
# Выделение месяца из даты для каждого пользователя. Пример для user_id = 1

sql = '''
select *, date_trunc('month', date) as month
from purchases
where user_id = 1
order by month
'''
select(sql)

    purchase_id  item_id  user_id                date    amount      month
0          2155       85        1 2007-05-20 11:20:10    178.10 2007-05-01
1          3412       73        1 2007-06-26 00:14:54   -655.44 2007-06-01
2          2162       13        1 2007-07-05 09:02:00  10043.05 2007-07-01
3           256       69        1 2007-08-14 09:05:33   1057.14 2007-08-01
4           204      108        1 2007-08-17 13:11:51    180.39 2007-08-01
5          1043       87        1 2007-10-03 11:59:15    102.82 2007-10-01
6          4686       47        1 2007-10-07 15:37:47   1058.94 2007-10-01
7          1321      122        1 2007-10-16 18:45:51    171.60 2007-10-01
8           220       82        1 2007-10-04 18:12:59    167.49 2007-10-01
9          3689      102        1 2007-11-21 01:29:50    148.86 2007-11-01
10         4598       57        1 2007-11-23 00:36:34     70.69 2007-11-01
11         2206       12        1 2007-11-27 07:46:09   2077.82 2007-11-01
12         1657        9        1 2007-12-17 08:22:06   2083.76 2007-12-01
13         2852      110        1 2008-01-02 16:15:14    158.38 2008-01-01
14         1957      153        1 2008-01-30 10:29:25    133.73 2008-01-01
15         4517       64        1 2008-01-28 07:06:49   1064.57 2008-01-01
16          894       56        1 2008-01-27 21:17:35   2064.10 2008-01-01
17          638       52        1 2008-02-14 01:58:09     82.17 2008-02-01
18          418       88        1 2008-02-20 21:26:05   1124.31 2008-02-01
19         4764      143        1 2008-02-11 23:40:05  10073.13 2008-02-01
20          715       95        1 2008-03-18 18:40:46     43.69 2008-03-01
21         1606      101        1 2008-03-11 09:57:00   -648.08 2008-03-01
22         3795      172        1 2008-03-23 12:57:07    159.33 2008-03-01
23         2702       38        1 2008-04-23 17:59:18    137.04 2008-04-01
24          663       12        1 2008-04-20 22:24:11  10059.49 2008-04-01
25         4065      153        1 2008-04-22 18:50:55   2067.09 2008-04-01
26         2134      122        1 2008-05-09 12:43:29  10080.25 2008-05-01
27          489       42        1 2008-05-20 09:38:42    149.76 2008-05-01
28         1141       10        1 2008-06-10 19:01:19   1117.06 2008-06-01
29          795      113        1 2008-06-19 10:57:04    182.90 2008-06-01

In [14]:
# Сумма покупок по месяцам для каждого пользователя. Пример для user_id = 1

sql = '''
SELECT user_id, date_trunc('month', date) AS month, SUM(amount) AS sum_amount
FROM purchases
where user_id = 1
GROUP BY user_id, month
ORDER by month
'''
select(sql)

    user_id      month  sum_amount
0         1 2007-05-01      178.10
1         1 2007-06-01     -655.44
2         1 2007-07-01    10043.05
3         1 2007-08-01     1237.53
4         1 2007-10-01     1500.85
5         1 2007-11-01     2297.37
6         1 2007-12-01     2083.76
7         1 2008-01-01     3420.78
8         1 2008-02-01    11279.61
9         1 2008-03-01     -445.06
10        1 2008-04-01    12263.62
11        1 2008-05-01    10230.01
12        1 2008-06-01     1299.96

In [15]:
# Средняя сумма покупок в месяц для каждого пользователя.

sql = '''
SELECT user_id, AVG(sum_amount) AS average_amount
FROM (
  SELECT user_id, date_trunc('month', date) AS month, SUM(amount) AS sum_amount
  FROM purchases
  GROUP BY user_id, month
) AS subquery
GROUP BY user_id
ORDER by user_id
'''
select(sql)

    user_id  average_amount
0         1     4210.318462
1         2     3952.463636
2         3     2343.132500
3         4     5462.283000
4         5     3273.117778
..      ...             ...
95       96     3146.520833
96       97     4654.290000
97       98     4381.052727
98       99     1277.441111
99      100     1719.471667

[100 rows x 2 columns]

In [16]:
# Средняя сумма покупок в месяц для каждого пользователя c учетом возраста > 18 и <= 25 лет

sql = '''
SELECT subquery.user_id, AVG(subquery.average_amount) AS average_amount_per_month
FROM (
  SELECT purchases.user_id, date_trunc('month', purchases.date) AS month, AVG(purchases.amount) AS average_amount
  FROM purchases
  INNER JOIN users ON purchases.user_id = users.user_id
  WHERE users.age > 18 AND users.age <= 25
  GROUP BY purchases.user_id, month
) AS subquery
GROUP BY subquery.user_id
ORDER BY user_id
'''
select(sql)

    user_id  average_amount_per_month
0         3               1462.791389
1         6               1817.444458
2        22               1440.044444
3        24               1551.153981
4        29               1406.616319
5        38               2814.136154
6        41               2053.703652
7        44               1665.046139
8        51               1739.057550
9        55               2682.807639
10       66               1394.742083
11       77               1415.332431
12       85               2573.313722
13       86               1643.185333
14       87               1863.654556
15       89               2575.639242
16       90               1603.061111
17       95                580.652381
18       97               1400.112250

#### Какую сумму в среднем в месяц тратят пользователи в возрастном диапазоне от 26 до 35 лет включительно

In [17]:
# Средняя сумма покупок в месяц для каждого пользователя c учетом возраста > 18 и <= 25 лет

sql = '''
SELECT subquery.user_id, AVG(subquery.average_amount) AS average_amount_per_month
FROM (
  SELECT purchases.user_id, date_trunc('month', purchases.date) AS month, AVG(purchases.amount) AS average_amount
  FROM purchases
  INNER JOIN users ON purchases.user_id = users.user_id
  WHERE users.age > 26 AND users.age <= 35
  GROUP BY purchases.user_id, month
) AS subquery
GROUP BY subquery.user_id
ORDER BY user_id
'''
select(sql)

    user_id  average_amount_per_month
0         1               2132.985192
1         7                835.621667
2         8               1985.765227
3        11               1481.680121
4        13               2331.616500
5        15               2035.175361
6        22               1440.044444
7        23               1534.469667
8        25               2177.457818
9        26                999.028694
10       30               1330.067500
11       34               2568.566364
12       35               1047.823077
13       43               1689.203119
14       44               1665.046139
15       46               1354.509583
16       50                601.042500
17       51               1739.057550
18       62                862.719924
19       65               1995.952966
20       68                978.375182
21       70               3009.892051
22       75               1348.929083
23       79               1589.145278
24       83               2425.551000
25       85               2573.313722
26       88               1395.858889
27       96               1437.702986
28       97               1400.112250

### Задание Б

#### В каком месяце года выручка от пользователей в возрастном диапазоне 35+ самая большая

In [18]:
# Определение ID пользователей с возрастом > 35 лет

sql = '''
SELECT * 
FROM users 
WHERE age > 35
ORDER by user_id
'''
select(sql)

     user_id   age
0          2  57.0
1          3  74.0
2         10  61.0
3         10  62.0
4         12  54.0
..       ...   ...
407      986  54.0
408      987  39.0
409      988  39.0
410      988  57.0
411      997  37.0

[412 rows x 2 columns]

In [19]:
# Оставляем в таблице purchases только те user_id у которых возраст > 35 лет 
# Добавляем месяц к каждому пользователю

sql = '''
SELECT *, DATE_TRUNC('month', date) AS month
FROM purchases
WHERE purchases.user_id IN (
  SELECT user_id
  FROM users
  WHERE age > 35
)
ORDER BY user_id
'''
select(sql)

     purchase_id  item_id  user_id                date   amount      month
0            899       16        2 2008-01-18 23:42:52  2071.35 2008-01-01
1           4169      173        2 2007-12-12 17:31:32  1074.19 2007-12-01
2           1134       46        2 2007-07-03 16:44:22   201.20 2007-07-01
3           2576      148        2 2007-11-24 04:59:52  1087.90 2007-11-01
4           1899      155        2 2008-01-26 20:42:30   158.90 2008-01-01
..           ...      ...      ...                 ...      ...        ...
838         4429      169      100 2007-05-06 18:06:16   161.56 2007-05-01
839          861      109      100 2008-04-10 05:41:12   119.23 2008-04-01
840         4435      152      100 2008-03-11 09:57:00  1056.18 2008-03-01
841          807       15      100 2007-07-03 16:44:22    94.58 2007-07-01
842         2071      142      100 2007-08-21 18:09:07  1055.52 2007-08-01

[843 rows x 6 columns]

In [20]:
# Суммируем выручку по месяцам и сортируем по убыванию общей суммы, оставляем топ-1

sql = '''
SELECT DATE_TRUNC('month', p.date) AS month, SUM(p.amount) AS total_amount
FROM purchases p
WHERE p.user_id IN (
  SELECT u.user_id
  FROM users u
  WHERE u.age > 35
)
GROUP BY month
ORDER BY total_amount DESC
LIMIT 1
'''
select(sql)

       month  total_amount
0 2008-05-01     155907.75

### Задание B

#### Какой товар дает наибольший вклад в выручку за последний год

In [21]:
# Определяем последний год

sql = '''
SELECT MAX(EXTRACT(YEAR FROM date)) AS max_year
FROM purchases
'''
select(sql)

   max_year
0    2008.0

In [22]:
# Определение ТОП-1 товаров по выручке за последний год

sql = '''
SELECT p.item_id, SUM(p.amount * i.price) AS total_revenue
FROM purchases p
JOIN items i ON p.item_id = i.item_id
WHERE EXTRACT(YEAR FROM p.date) = (
  SELECT MAX(EXTRACT(YEAR FROM date))
  FROM purchases
)
GROUP BY p.item_id
ORDER BY total_revenue DESC
LIMIT 1
'''
select(sql)

   item_id  total_revenue
0       22   3.282768e+08

### Задание Г

#### Топ-3 товаров по выручке и их доля в общей выручке за любой год

In [23]:
sql = '''
SELECT 
    p.item_id, 
    SUM(p.amount * i.price) AS total_revenue,
    SUM(p.amount * i.price) / total.total_revenue AS revenue_share
FROM purchases p
JOIN items i ON p.item_id = i.item_id
JOIN (
    SELECT 
        SUM(p.amount * i.price) AS total_revenue
    FROM purchases p
    JOIN items i ON p.item_id = i.item_id
    WHERE EXTRACT(YEAR FROM p.date) = 2008
) AS total ON 1=1
WHERE EXTRACT(YEAR FROM p.date) = 2008
GROUP BY p.item_id, total.total_revenue
ORDER BY total_revenue DESC
LIMIT 3
'''
select(sql)

   item_id  total_revenue  revenue_share
0       22   3.282768e+08       0.091825
1      109   3.119126e+08       0.087247
2      103   3.108878e+08       0.086961